{
  "main": {
    "name": "Hillary Okello",
    "occupation": "Python-Django && ReactJS Developer && Ruby && Ruby on Rails Developer",
    "description": "Full Stack React Developer by Day, Founder && Freelancer by Night.",
    "image": "Hillary.jpg",
    "bio": "My name is Hillary Okello. I am a software engineer from Jinja, Uganda. My expertise is in web technologies, and I specialize in Python-Django web framework, Ruby on Rails, React and Redux. I work with frontend technology such as React, Jquery and Bootstrap. I have also worked with Python Django web framework to create websites for my clients while freelancing. I attended Microverse, an online coding school to master every aspect of skills that professional programmers need in their daily lives from the technical skills(Ruby / Ruby on Rails / Javascript / React and Redux / HTML / CSS) to the soft skills(Pair Programming / Remote Working / Team Collaboration / Mentoring). Now, I can comfortably build solutions based on ideas, solve business puzzles and give professional advice with my coding knowledge. I love to help businesses grow with coding so that people can focus on creating beautiful things for society instead of working on repetitive tasks.",
    "contactmessage": "Get in touch with me to receive further details, get coached or anything else.",
    "email": "hillariouskelly@outlook.com",
    "phone": "+256 756 274 269",
    "address": {
      "street": "Main Street",
      "city": "Jinja",
      "state": "Uganda"
    },
    "website": "http://www.hillaryokello.com",
    "resumedownload": "https://drive.google.com/file/d/14WGi12SS9VYfqFCkyic5VRyTbLWq92A_/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/hillary.okello.50/",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/hillary-okello/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/hillary_okello9/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/HillaryOkello",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I have the following skills",
    "education": [
      {
        "school": "Microverse",
        "degree": "Software Development",
        "graduated": "August 2021",
        "description": "Gained professional experience with industry best practices(Git Flow, Linters, Pair Programming, OOP, SOLID, MVC, TDD). Mastered mainstream technologies in web development(Ruby on Rails, React/Redux, Javascript(ES6), SQL) by building 20+ real-world projects. Gained proficiency in coding with 300+ hours in studying data structures and algorithms, solving challenges in Hackerank and Github classroom. Became a global citizen by spending 2000+ hours in remote working with team members from all over the world(over 100 countries)"
      }
    ],
    "work": [
      {
        "company": "Microverse",
        "title": "Student Mentor",
        "years": "November 2020 - February 2021",
        "description": "I helped students quickly adapt to the fast-paced learning environment at Microverse. I shared personal stories, personal ideas, professional experiences to inspire and educate students. I clarified doubts to and give optimal advise to help students to get through the difficulties in their coding and personal life."
      },
      {
        "company": "Freelancing",
        "title": "Freelancer",
        "years": "February 2019 - October 2020",
        "description": "I freelanced as a web developer, designing and building websites for clients from freelancer.com and locally in my town."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "text": "I started learning python online following Youtube tutorial. Later on I joined CODEIT Institute of Technology (CIT) an online American school, where I got certified as a python developer. I made a music application using python with Tkinter and Pygame libraries"
      },
      {
        "name": "Django",
        "text": "I learnt Django, python web framework after learning python. I like its Model-View-Template architecture, it helps to work on different components parallelly,and integrating them much more efficiently. I built a voting application for one of my classes at CODEIT Institute of Technology."
      },
      {
        "name": "Ruby",
        "text": "When I joined Microverse, Ruby was one of the programming languages I was eager to learn. At first, I thought it was similar to python but while learning it, I realized they are different with very few similarities. I built a ruby linter, a program that checks for errors in ruby code when i finished learning the module in Microverse"
      },
      {
        "name": "Ruby on Rails",
        "text": "I learnt rails while at microverse, I do enjoy using rails to build web application. One of the projects I enjoyed building using rails was my project manager application called Hilnex Project Manager."
      },
      {
        "name": "JavaScript",
        "text": "I use JavaScript when working on basic web applications. I have built a couple of projects using it including a weather application, an RPG game with phaser3 framework."
      },
      {
        "name": "ReactJs",
        "text": "Among the JavaScript frameworks, I know ReactJs. It makes work easier for me by facilitating the overall process of writing components and boots my productivity."
      },
      {
        "name": "Git",
        "text": "I use Git for all of my projects so far. I have used Git for version control in small teams. It's one of my favorite development tools."
      },
      {
        "name": "PHP",
        "text":"PHP was the first scripting language I leant for web development. I have built a coupon generating website and other websites for clients using PHP while freelancing."
      },
      {
        "name": "SQL",
        "text": "I use SQL as my database when working on PHP projects. It is one of the Relational Databases I have had the pleasure of using for my projects."
      },
      {
        "name": "MongoDB",
        "text": "I am fairly new to MongoDB and haven't used it so much. Am still learning how it works and experimenting with it on different projects."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Music Medals",
        "category": "An RPG Game build with JavaScript and Phaser library about an alien boy who collects music medals while avoiding mines.",
        "tech": "JavaScript, Webpack, Phaser",
        "image": "game.png",
        "url": "https://boring-carson-13aee4.netlify.app/",
        "github": "https://github.com/HillaryOkello/RPG-Game"
      },
      {
        "title": "Weather App",
        "category": "Weather application built with JavaScript and openweather API. It fetches weather information for any city in the world and displays.",
        "tech": "JavaScript, Webpack, HTML5",
        "image": "weather-app.png",
        "url": "http://hillaryokello.me/weather-app-js/",
        "github":"https://github.com/HillaryOkello/weather-app-js"
      },
      {
        "title": "My Library",
        "category": "A Library developed in Javascript where you can add new books, remove the books created and change the status of the book, from read to not read.",
        "tech": "JavaScript, HTML5",
        "image": "mylibrary.png",
        "url": "https://jovial-lamport-0da5e3.netlify.app/",
        "github": "https://github.com/HillaryOkello/Library"
      },
      {
        "title": "Hilnex Project Manager",
        "category": "This is a project management application that allows you to group hours spent on different projects at your university. You can group your projects in different categories and note down how many hours you spend on each project.",
        "tech": "Ruby, Rails, Bootstrap, SASS, PostgreSQL",
        "image": "Hilnex P.png",
        "url": "https://hilnexprojectmanager.herokuapp.com/",
        "github": "https://github.com/HillaryOkello/Rails-Capstone"
      },
      {
        "title": "Hilnex Educator",
        "category": "Hilnex Educator is an online course directory, it helps you find the right online course for you. You can search, locate and enroll in any course you are interested in and get to learn new things. It is built with HTML, CSS, Bootstrap and SASS. I built it as my capstone project after completing the HTML and CSS module at Microverse",
        "tech": "HTML5, CSS, Bootstrap, SCSS",
        "image": "Hilnex E.png",
        "url": "https://hillaryokello.github.io/Hilnex-Educator/",
        "github": "https://github.com/HillaryOkello/Hilnex-Educator"
      }
    ]
  }
}